# WorksharingSaveAsOptions Class

---
This class contains options specific to worksharing SaveAs.
SystemObject Autodesk.Revit.DBWorksharingSaveAsOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class WorksharingSaveAsOptions : IDisposable

    Public Class WorksharingSaveAsOptions
    	Implements IDisposable

    public ref class WorksharingSaveAsOptions : IDisposable

    type WorksharingSaveAsOptions =
        class
            interface IDisposable
        end
The WorksharingSaveAsOptions type exposes the following members.
| Name| Description
---|---|---
| WorksharingSaveAsOptions|  Constructs a new WorksharingSaveAsOptions with default settings.
Top
| Name| Description
---|---|---
| ClearTransmitted|  For a transmitted model opened with DetachAndPreserveWorksets, clear its transmitted flag in the Save/SaveAs operation.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| OpenWorksetsDefault|  The default set of user-worksets to open when opening the model in the UI. Default is AskUserToSpecify.
| SaveAsCentral|  Whether to save the new model as a central instead of local model. True: save as a central model. Default is false: save as a local model.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the WorksharingSaveAsOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace